'use strict';

describe ('App module', function() {
  let module;
  before(() => {
    module = angular.module('myApp');
  });

  it('Протестировать подсветку текущего пункта меню', function() {
    
  });

  it('Протестировать адрес /myaccount, убедиться что по нему открывается форма', function() {
    
  });

  it('Протестистировать обязательные поля в форме', function() {
    
  });

  it('Протестировать добавление покемона в корзину', function() {
    
  });

  it('Протестировать список покемонов. Убедиться что показано столько покемонов, сколько требуется', function() {
    
  });

});
